-- 🌊 GawrVim

-- Включаем нумерацию строк
vim.opt.number = true            -- абсолютные номера
vim.opt.relativenumber = false    -- относительные номера (Отчет идет от теккущей строки)
vim.opt.cursorline = true        -- подсветка текущей строки
vim.opt.signcolumn = "yes"       -- колонка для иконок (ошибки, брейкпоинты и т.п.)
vim.opt.termguicolors = true     -- включаем поддержку 24-битных цветов
vim.opt.wrap = false             -- отключаем перенос длинных строк
vim.opt.scrolloff = 4            -- отступ сверху/снизу при прокрутке

-- Сообщение при загрузке ErrorMsg WarningMsg ModeMsg MoreMsg
-- Красное типа - желто-оранжевое - зелёное - голубое
vim.api.nvim_echo({{"GawrVim loaded ✓", "MoreMsg"}}, false, {})
